{
    "Apple Apple scab": "How to manage apple scab in apples and crabapples. Planting disease resistant varieties is the best way to prevent apple scab. Many varieties of apple and crabapple trees are resistant or completely immune to apple scab.",

    "Apple Black rot": "Monitoring and management Managing black rot in orchards relies on the integration of cultural and chemical methods together in an integrated pest management program. There are no cultivars completely resistant to black rot, but some are less susceptible to this disease than others (Table 4-11). Selecting cultivars that are less susceptible to black rot for planting near sources of disease (woodlots) may help reduce yield losses. Pruning out diseased limbs and dead wood is an important practice to reduce the inoculum sources within the orchard. It is important to remove prunings from the orchard or burn them since black rot fungus can survive on dead tissue. Alternatively, chopping up the prunings on the orchard floor with a flail mower reduces inoculum levels. Woodpiles must not be stacked in or near orchards since they can be a major source of inoculum. Make an attempt to scout surrounding woodlots and identify hardwood trees infected with the disease. If possible, remove and burn these trees to decrease potential disease pressure. It is important to obtain a neighbour's permission to cut down infected trees identified on an adjacent property.",

    "Apple Cedar apple rust": "Cedar apple rust is caused by the fungi Gymnosporangium or more specifically Gymnosporangium juniperi-virginianae that spend part of their life cycles on Eastern Red Cedars growing near orchards. The complex disease cycle of cedar apple rust, alternating between two host plants, was first delineated by Anders Sandøe Ørsted. CONTROL: Because apples are an economically important crop, control is usually focused there. Interruption of the disease cycle is the only effective method for control of the cedar apple rust. Removing as many cedar trees within close proximity of an apple orchard will reduce potential sources of inoculum. The closer the tree to the orchard, the greater impact removal will have. Removing all Junipers within the 4-5 miles (6.5-8 km) would provide complete control of the disease. Additionally, pruning and disposing of galls from infected cedar trees would reduce sources of inoculum for infection of apple trees, however this would likely be time-consuming and uneconomical.",

    "Cherry(including sour) Powdery mildew": "Powdery mildew of sweet and sour cherry is caused by Podosphaera clandestina, an obligate biotrophic fungus. Mid- and late-season sweet cherry (Prunus avium) cultivars are commonly affected, rendering them unmarketable due to the covering of white fungal growth on the cherry surface.",

    "Corn(maize) Cercospora leaf spot Gray leaf spot": "Grey leaf spot (GLS) is a foliar fungal disease that affects maize, also known as corn. GLS is considered one of the most significant yield-limiting diseases of corn worldwide. There are two fungal pathogens that cause GLS: Cercospora zeae-maydis and Cercospora zeina.",

    "Corn(maize) Common rust": "Common rust is caused by the fungus Puccinia sorghi and occurs every growing season. It is seldom a concern in hybrid corn. Rust pustules usually first appear in late June. Early symptoms of common rust are chlorotic flecks on the leaf surface.",

    "Corn(maize) Northern Leaf Blight": "Northern corn leaf blight (NCLB) is caused by the fungus Setosphaeria turcica. Symptoms usually appear first on the lower leaves. Leaf lesions are long (1 to 6 inches) and elliptical, gray-green at first but then turn pale gray or tan. Under moist conditions, dark gray spores are produced, usually on the lower leaf surface, which gives lesions a dirty gray appearance.",

    "Grape Black rot": "Grape black rot is a fungal disease caused by an ascomycetous fungus, Guignardia bidwellii, that attacks grape vines during hot and humid weather. Grape black rot originated in eastern North America but now occurs in portions of Europe, South America, and Asia. It can cause complete crop loss in warm, humid climates, but is virtually unknown in regions with arid summers.",

    "Grape Esca(Black Measles)": "The foliar symptom of Esca is an interveinal striping. The stripes, which start out as dark red in red cultivars and yellow in white cultivars, dry and become necrotic. Foliar symptoms may occur at any time during the growing season but are most prevalent during July and August.",

    "GrapeLeaf blight(Isariopsis Leaf Spot)": "Leaf blight, also called Isariopsis leaf spot (Pseudocercospora vitis) on Grape (Vitus sp.) Scattered, somewhat angular, purple-brown spots on the upper leaf surface. Corresponding, less conspicuous, brown spots on the lower leaf surface. Numerous scattered, somewhat angular, purple-brown spots on the upper leaf surface.",

    "Orange Haunglongbing(Citrus greening)": "HLB was originally thought to be a viral disease but was later discovered to be caused by bacteria, carried by insect vectors. Control: Some cultural practices can be effective in managing this disease. Cultural methods include antibacterial management, sanitation, removal of infected plants, frequent scouting, and most importantly, crisis declaration. Tracking the disease will help prevent further infection in other affected areas and help mitigate more local infections if detected early enough. The Asian citrus psyllid has alternative hosts that may attract psyllids to citrus plants in the vicinity such as Murraya paniculata, Severinia buxifolia, and other plants in the family Rutaceae.",

    "PeachBacterial spot": "Bacterial spot can affect leaves, twigs, and fruit of peaches and other stone fruits. The disease can cause slight to nearly complete defoliation of infected trees. When significant defoliation occurs early in the season, fruit size can be reduced.",

    "Pepper, bell Bacterial spot": "Bacterial spot, caused by Xanthomonas campestris pv. vesicatoria, is the most common foliar disease of pepper (Capsicum spp.). The disease can cause early defoliation, yield losses, and poor fruit quality. The pathogen also infects tomato and many solanaceous weeds.",

    "Potato Early blight": "Early blight of potato is caused by the fungus, Alternaria solani, which can cause disease in potato, tomato, other members of the potato family, and some mustards. Control: Varieties resistant to this disease are available. In general, late maturing varieties are more resistant than the earlier maturing varieties. Keep plants healthy; stressed plants are more predisposed to early blight. Avoid overhead irrigation. Do not dig tubers until they are fully mature to prevent damage. Do not use a field for potatoes that was used for potatoes or tomatoes the previous year. Keep this year’s field at least 225 to 450 yards away from last year’s field. Surround the field with wheat to keep wind-blown spores from entering.",

    "Potato Late blight": "Late blight is a disease common in solanaceous plants like potatoes, tomatoes, etc. It is caused by an oomycete pathogen, i.e., Phytophthora infestans. Late blight in a potato is a lethal disease that can have the potential to devastate the crop. It can attack the crop at any stage and can infect the foliage and tubers.",

    "Squash Powdery mildew": "Powdery mildew on squash (and other plants) is pretty simple to identify. The first thing you'll probably notice is blotchy patches of white-gray powdery spots that are dry to the touch on the surface of leaves. Treatment: One of the most effective sprays is neem oil, an extract from the tropical neem tree. It's a good control for mild to moderate powdery mildew infections. Spray both upper and lower surfaces of leaves. Apply every week until you detect no more symptoms, then every two weeks to avoid the mildew's return.",

    "Strawberry Leaf scorch": "Leaf scorch symptoms are very similar to the early stages of common (Mycosphaerella) leaf spot, with irregular dark purple spots being scattered over the upper leaf surface. As the spots enlarge, they begin to look like drops of tar, and are actually the accumulations of black fruiting bodies (acervuli) of the fungus. The centers of the spots remain purple (in Mycosphaerella leaf spot, they are white) and there is no well-defined lesion border. Management: In matted row or perennial strawberry systems, select a planting site with good air drainage and sun exposure. Cultivars resistant to leaf scorch may be available and need to be evaluated for specific horticultural characteristics. Plant new transplants frequently, and allow adequate spacing between them to increase airflow. Control weeds. Avoid amendment with supplemental nitrogen in spring, as this may enhance disease. Keep moisture levels down and avoid long wetness periods by monitoring irrigation schedules; if possible, use drip irrigation rather than overhead. Remove foliage and crop residues after picking or at renovation to remove inoculum and delay disease increase in late summer and fall. Fungicide treatments are effective during the flowering period and during late summer and fall.",

    "Tomato Bacterial spot": "Tomato bacterial spot is a disease that affects tomatoes worldwide. It is caused by four species of Xanthomonas bacteria that can infect the leaves, stems, and fruits of tomato plants. MANAGEMENT: Plant pathogen-free seed or transplants. If you suspect that your seed is contaminated, you can soak it in hot water (122°F) for 25 minutes to kill the bacteria. Avoid overhead watering and use drip irrigation or soaker hoses instead. This will keep the leaves dry and reduce the spread of the bacteria.",

    "Tomato Early blight": "Tomato early blight is a common disease that affects tomato and potato plants. It is caused by a fungus called Alternaria solani, which can infect the leaves, stems, and fruits of the plants. The disease causes dark spots with concentric rings on the leaves and fruits and can reduce the yield and quality of the crops. Management: Plant resistant or tolerant varieties, if available. Use certified disease-free seeds or transplants. Avoid overhead irrigation and water the plants at the base to keep the foliage dry. Remove and destroy infected plant debris and avoid composting them. Rotate crops with non-susceptible plants, such as corn, beans, or lettuce, for at least two years. Apply organic or synthetic fungicides as needed, following the label instructions.",

    "Tomato Late blight": "Tomato late blight is a disease that affects tomato and potato plants. It is caused by a fungus-like organism that can infect the leaves, stems, and fruits of the plants. The disease causes dark spots with concentric rings on the leaves and fruits and can reduce the yield and quality of the crops. Management: Plant resistant or tolerant varieties, if available. Use certified disease-free seeds or transplants. Avoid overhead irrigation and water the plants at the base to keep the foliage dry.",

    "Tomato Leaf Mold": "Tomato leaf mold is a disease that affects tomato plants, especially in greenhouses and high tunnels. It is caused by a fungus that infects the leaves and sometimes the fruits of the plants. The disease causes yellow spots on the upper side of the leaves and olive-green mold on the lower side. The leaves may wither and die, and the fruits may develop black, sunken areas. Management: To prevent and control tomato leaf mold, you can plant resistant or tolerant varieties, if available. Use certified disease-free seeds or transplants. Avoid overhead irrigation and water the plants at the base to keep the foliage dry. Remove and destroy infected plant debris and avoid composting them.",

    "Tomato Septoria leaf spot": "Tomato Septoria leaf spot is a fungal disease that affects the leaves of tomato plants. It causes small, circular, gray spots with dark borders and yellow halos on the lower leaves. The spots may enlarge and merge, causing the leaves to turn yellow and fall off. The disease can reduce the yield and quality of the tomatoes and make them more prone to sun scald. Management: To prevent and control tomato Septoria leaf spot, you can plant resistant or tolerant varieties, if available. Use certified disease-free seeds or transplants. Avoid overhead irrigation and water the plants at the base to keep the foliage dry.",

    "Tomato Spider mites Two-spotted spider mite": "Tomato spider mites are tiny arthropods that feed on the sap of tomato plants, causing damage to the leaves and fruits. They can reduce the yield and quality of the tomatoes and make them more susceptible to other pests and diseases. One of the most common species of tomato spider mites is the two-spotted spider mite (TSSM), which has a pair of dark spots on its body. Management: To prevent and control tomato spider mites, you can plant resistant or tolerant varieties, if available. Use certified disease-free seeds or transplants. Avoid overhead irrigation and water the plants at the base to keep the foliage dry. Remove and destroy infected plant debris and avoid composting them.",

    "Tomato Target Spot": "Tomato target spot is a fungal disease that affects the leaves and fruits of tomato plants. It causes circular spots with concentric rings and gray to pale brown centers on the leaves and small, brown or black spots on the fruits. The disease can reduce the yield and quality of the tomatoes and make them more susceptible to sun scald. Management: To prevent and control tomato target spot, you can plant resistant or tolerant varieties, if available. Use certified disease-free seeds or transplants. Avoid overhead irrigation and water the plants at the base to keep the foliage dry.",

    "Tomato Tomato Yellow Leaf Curl Virus": "Tomato yellow leaf curl virus (TYLCV) is a viral disease that affects tomato plants and causes yellowing and curling of the leaves, stunting of the plants, and reduced fruit yield and quality. It is transmitted by whiteflies, especially the silverleaf whitefly (Bemisia tabaci), which can carry the virus from infected to healthy plants. TYLCV is a serious threat to tomato production in tropical and subtropical regions of the world, and can also infect other crops such as peppers, eggplants, beans, an tobacco1. Some of the ways to prevent and manage TYLCV are: Plant resistant or tolerant varieties of tomatoes, if available. Some varietie have bee developed or identified that can resist or tolerate the virus infection and reduce the symptoms and yield losses. Use certified disease-fre seeds o transplants, and avoid planting near infected fields or greenhouses. The virus can be introduced into a new area by contaminated seeds o plants, so i is important to use clean and healthy materials. Infected plants can serve as a source of the virus and whiteflies, so they should be removed as soon as possible and disposed of properly. Burning or burying the infected materials can help prevent further contamination",
    
    "Tomato Tomato mosaic virus":"Tomato mosaic virus is a plant disease that affects tomatoes and many other plants. It causes yellow and green mottling on the leaves and fruits, and can reduce the yield and quality of the crops. The virus can be spread by contaminated seeds, tools, hands, and insects. It can also survive in the soil and plant debris for a long time. To prevent and control tomato mosaic virus, you should use disease-free seeds and plants, avoid touching or injuring the plants, control the insect pests, remove and destroy the infected plants, and rotate the crops with non-susceptible plants. You can also use resistant or tolerant varieties of tomatoes, if available." 

}

